## Import Libraries

In [1]:
#Suppress FutureWarnings
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

import pandas as pd 
import numpy as np 
import seaborn as sns 

#display the graphics made by python inline with the text
%matplotlib inline
import matplotlib.pyplot as plt

## Load data

In [2]:
train = pd.read_csv('Train.csv')
test = pd.read_csv('Test.csv')
submission = pd.read_csv('SampleSubmission.csv')

## Understand the Data with Descriptive Statistics

In [3]:
#Check the shape and size of datasets
train.shape, test.shape, submission.shape

((108446, 42), (46477, 41), (46477, 2))

In [4]:
#peek at the data
train.tail()

,ID,country_code,region,age,FQ1,FQ2,FQ3,FQ4,FQ5,FQ6,...,FQ27,FQ28,FQ29,FQ30,FQ31,FQ32,FQ33,FQ34,FQ37,Target
108441,ID_ZZYY7RTO,111,4,23.0,2,NaN,NaN,2,NaN,2.0,...,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,1,0
108442,ID_ZZYZTTC6,77,4,60.0,1,NaN,NaN,2,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1.0,1.0,1,0
108443,ID_ZZZ3OW3S,42,2,59.0,1,NaN,1.0,1,NaN,NaN,...,NaN,NaN,2.0,NaN,NaN,2.0,1.0,2.0,1,1
108444,ID_ZZZLDXE8,57,7,79.0,1,NaN,NaN,2,NaN,1.0,...,NaN,NaN,2.0,NaN,NaN,NaN,1.0,1.0,1,0
108445,ID_ZZZMYW1F,110,2,74.0,2,1.0,2.0,2,NaN,1.0,...,NaN,NaN,1.0,NaN,NaN,NaN,1.0,NaN,1,1

In [5]:
#Look at first 5 records
test.head()

,ID,country_code,region,age,FQ1,FQ2,FQ3,FQ4,FQ5,FQ6,...,FQ26,FQ27,FQ28,FQ29,FQ30,FQ31,FQ32,FQ33,FQ34,FQ37
0,ID_000YI58E,39,2,22.0,2,NaN,NaN,2,NaN,1.0,...,2,NaN,NaN,NaN,NaN,NaN,2.0,1.0,1.0,0
1,ID_001SP4JF,30,2,62.0,1,NaN,NaN,2,NaN,1.0,...,2,NaN,NaN,2.0,NaN,1.0,1.0,1.0,1.0,0
2,ID_001VOF6S,65,4,35.0,2,1.0,NaN,1,1.0,NaN,...,2,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,0
3,ID_0030LULG,123,0,24.0,2,1.0,NaN,2,NaN,1.0,...,2,NaN,NaN,2.0,NaN,NaN,NaN,1.0,1.0,1
4,ID_0037PZ3R,67,2,25.0,2,NaN,NaN,1,NaN,NaN,...,2,NaN,NaN,1.0,NaN,NaN,NaN,2.0,1.0,1

In [6]:
submission.head()

            ID  Target
0  ID_000YI58E     NaN
1  ID_001SP4JF     NaN
2  ID_001VOF6S     NaN
3  ID_0030LULG     NaN
4  ID_0037PZ3R     NaN

In [7]:
#Check the columns in the train dataset
train.columns

Index(['ID', 'country_code', 'region', 'age', 'FQ1', 'FQ2', 'FQ3', 'FQ4',
       'FQ5', 'FQ6', 'FQ7', 'FQ8', 'FQ9', 'FQ10', 'FQ11', 'FQ12', 'FQ13',
       'FQ14', 'FQ15', 'FQ16', 'FQ17', 'FQ18', 'FQ19', 'FQ20', 'FQ21', 'FQ22',
       'FQ23', 'FQ24', 'FQ35', 'FQ36', 'FQ25', 'FQ26', 'FQ27', 'FQ28', 'FQ29',
       'FQ30', 'FQ31', 'FQ32', 'FQ33', 'FQ34', 'FQ37', 'Target'],
      dtype='object')

In [8]:
#data type and columns of each attribute
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 108446 entries, 0 to 108445
Data columns (total 42 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   ID            108446 non-null  object
 1   country_code  108446 non-null  int64
 2   region        108446 non-null  int64
 3   age           108124 non-null  float64
 4   FQ1           108446 non-null  int64
 5   FQ2           49124 non-null   float64
 6   FQ3           46218 non-null   float64
 7   FQ4           108446 non-null  int64
 8   FQ5           21185 non-null   float64
 9   FQ6           60659 non-null   float64
 10  FQ7           60620 non-null   float64
 11  FQ8           108446 non-null  int64
 12  FQ9           108446 non-null  int64
 13  FQ10          108446 non-null  int64
 14  FQ11          83876 non-null   float64
 15  FQ12          108446 non-null  int64
 16  FQ13          108446 non-null  int64
 17  FQ14          108446 non-null  int64
 18  FQ15          108446 non-null  int64
 19  FQ16          108446 non-null  int64
 20  FQ17          11347 non-null   float64
 21  FQ18          108446 non-null  int64
 22  FQ19          61039 non-null   float64
 23  FQ20          83767 non-null   float64
 24  FQ21          83811 non-null   float64
 25  FQ22          108446 non-null  int64
 26  FQ23          108446 non-null  int64
 27  FQ24          38432 non-null   float64
 28  FQ35          25889 non-null   float64
 29  FQ36          11483 non-null   float64
 30  FQ25          108446 non-null  int64
 31  FQ26          108446 non-null  int64
 32  FQ27          3200 non-null    float64
 33  FQ28          1506 non-null    float64
 34  FQ29          83912 non-null   float64
 35  FQ30          2115 non-null    float64
 36  FQ31          869 non-null     float64
 37  FQ32          60796 non-null   float64
 38  FQ33          108444 non-null  float64
 39  FQ34          76652 non-null   float64
 40  FQ37          108446 non-null  int64
 41  Target        108446 non-null  int64
dtypes: float64(22), int64(19), object(1)
memory usage: 34.7+ MB

In [9]:
#Statistical summary
train.describe()

,country_code,region,age,FQ1,FQ2,FQ3,FQ4,FQ5,FQ6,FQ7,...,FQ27,FQ28,FQ29,FQ30,FQ31,FQ32,FQ33,FQ34,FQ37,Target
count,108446.000000,108446.000000,108124.000000,108446.000000,49124.000000,46218.000000,108446.000000,21185.000000,60659.000000,60620.000000,...,3200.000000,1506.000000,83912.000000,2115.000000,869.000000,60796.000000,108444.000000,76652.000000,108446.000000,108446.000000
mean,68.544953,2.894242,41.857395,1.563294,1.063716,1.299710,1.824622,1.160113,1.223907,1.206961,...,1.578125,1.351262,1.860330,1.615130,1.436133,1.854744,1.178479,1.127511,0.631457,0.273970
std,41.529264,2.286505,17.876105,0.530077,0.288075,0.468503,0.435942,0.383827,0.450140,0.440780,...,0.563689,0.493938,0.382599,0.548808,0.557423,0.401499,0.398819,0.350632,0.482412,0.445996
min,0.000000,-1.000000,15.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000,0.000000
25%,33.000000,1.000000,27.000000,1.000000,1.000000,1.000000,2.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,2.000000,1.000000,1.000000,2.000000,1.000000,1.000000,0.000000,0.000000
50%,65.000000,3.000000,39.000000,2.000000,1.000000,1.000000,2.000000,1.000000,1.000000,1.000000,...,2.000000,1.000000,2.000000,2.000000,1.000000,2.000000,1.000000,1.000000,1.000000,0.000000
75%,105.000000,4.000000,55.000000,2.000000,1.000000,2.000000,2.000000,1.000000,1.000000,1.000000,...,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,1.000000,1.000000,1.000000,1.000000
max,143.000000,7.000000,99.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,...,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,1.000000,1.000000

In [10]:
#Examine distribution of the target column
train['Target'].value_counts()

0    78735
1    29711
Name: Target, dtype: int64

Here:
- 0: Did not use mobile or internet banking
- 1: Used mobile or internet banking

This shows that less people use moble or internet banking.

## Examine Missing & Duplicated Values
Data
There are also various ways to handle missing data:
 - Remove any row with missing data
 - Remove any column with missing data
 - Impute missing values

In [11]:
#Find duplicates
train.duplicated().any()

False

#train.isnull().any()

#Counting the Number of Null rows in each Column of the dataframe
train.isnull().sum()

#Counting the Number of Null rows in each Column of the dataframe
test.isnull().sum()

# Subset
target = train['target']
train_id = train['id']
test_id = test['id']
train.drop(['id'], axis=1, inplace=True)
test.drop('id', axis=1, inplace=True)

#Null values
null_df = pd.DataFrame({'Percentile':train.isnull().sum()/len(train), 'Count':train.isnull().sum()})
print(null_df)

## Understand Your Data With Visualization

#Create a bar plot of % of missing data counts using pandas
missing_values = train.isnull().sum() / len(train) *100 #in percentage
missing_values = missing_values[missing_values > 0]
missing_values.sort_values(inplace=True)
missing_values

missing_values.index

missing_values = missing_values.to_frame()
missing_values.columns = ['count']
sns.set(style="whitegrid", color_codes=True)
sns.barplot(x = missing_values.index, y = 'count', data=missing_values)
plt.xticks(rotation = 90)
plt.show()


Columns with type of object tend to be categorical (but they may also be high cardinality string data, or a mix of column types). For object columns that we believe to be categorical, use the .value_counts method to examine the counts of the values:

In [12]:
train.dtypes

ID               object
country_code      int64
region            int64
age             float64
FQ1               int64
FQ2             float64
FQ3             float64
FQ4               int64
FQ5             float64
FQ6             float64
FQ7             float64
FQ8               int64
FQ9               int64
FQ10              int64
FQ11            float64
FQ12              int64
FQ13              int64
FQ14              int64
FQ15              int64
FQ16              int64
FQ17            float64
FQ18              int64
FQ19            float64
FQ20            float64
FQ21            float64
FQ22              int64
FQ23              int64
FQ24            float64
FQ35            float64
FQ36            float64
FQ25              int64
FQ26              int64
FQ27            float64
FQ28            float64
FQ29            float64
FQ30            float64
FQ31            float64
FQ32            float64
FQ33            float64
FQ34            float64
FQ37              int64
Target            int64
dtype: object

>>> df.sex.value_counts(dropna=False)

Remember that pandas typically ignores null or NaN values. If you want to include those, use dropna=False to also show counts for NaN:
>>> df.embarked.value_counts(dropna=False)

## Dealing with Missing Values

In [13]:
# Total missing values for each feature
print (train.isnull().sum()/ len(train)*100)

ID               0.000000
country_code     0.000000
region           0.000000
age              0.296922
FQ1              0.000000
FQ2             54.701879
FQ3             57.381554
FQ4              0.000000
FQ5             80.464932
FQ6             44.065249
FQ7             44.101212
FQ8              0.000000
FQ9              0.000000
FQ10             0.000000
FQ11            22.656437
FQ12             0.000000
FQ13             0.000000
FQ14             0.000000
FQ15             0.000000
FQ16             0.000000
FQ17            89.536728
FQ18             0.000000
FQ19            43.714844
FQ20            22.756948
FQ21            22.716375
FQ22             0.000000
FQ23             0.000000
FQ24            64.561164
FQ35            76.127289
FQ36            89.411320
FQ25             0.000000
FQ26             0.000000
FQ27            97.049223
FQ28            98.611290
FQ29            22.623241
FQ30            98.049721
FQ31            99.198680
FQ32            43.938919
FQ33             0.001844
FQ34            29.317817
FQ37             0.000000
Target           0.000000
dtype: float64

In [14]:
total = train.isnull().sum().sort_values(ascending=False)
percent =total/len(train)*100
pd.concat([total,percent], axis=1, keys=['Total','Percent']).head(20)

       Total    Percent
FQ31  107577  99.198680
FQ28  106940  98.611290
FQ30  106331  98.049721
FQ27  105246  97.049223
FQ17   97099  89.536728
FQ36   96963  89.411320
FQ5    87261  80.464932
FQ35   82557  76.127289
FQ24   70014  64.561164
FQ3    62228  57.381554
FQ2    59322  54.701879
FQ7    47826  44.101212
FQ6    47787  44.065249
FQ32   47650  43.938919
FQ19   47407  43.714844
FQ34   31794  29.317817
FQ20   24679  22.756948
FQ21   24635  22.716375
FQ11   24570  22.656437
FQ29   24534  22.623241

Here you can clearly see that 7 columns have Null values higher than 80% so it is good to drop those columns from our data.

In [15]:
train = train [train.columns[train.isnull().mean() < 0.80]]
train

,ID,country_code,region,age,FQ1,FQ2,FQ3,FQ4,FQ6,FQ7,...,FQ24,FQ35,FQ25,FQ26,FQ29,FQ32,FQ33,FQ34,FQ37,Target
0,ID_000J8GTZ,1,6,35.0,2,NaN,NaN,2,NaN,1.0,...,NaN,1.0,2,2,1.0,NaN,1.0,1.0,0,0
1,ID_000QLXZM,32,7,70.0,2,NaN,NaN,2,NaN,1.0,...,NaN,NaN,1,1,2.0,NaN,1.0,2.0,0,0
2,ID_001728I2,71,7,22.0,2,1.0,NaN,2,NaN,1.0,...,NaN,NaN,2,1,2.0,NaN,2.0,1.0,1,0
3,ID_001R7IDN,48,3,27.0,1,NaN,NaN,2,2.0,NaN,...,NaN,NaN,2,2,NaN,2.0,1.0,1.0,1,0
4,ID_0029QKF8,25,0,79.0,2,NaN,NaN,2,NaN,NaN,...,2.0,NaN,2,2,2.0,2.0,1.0,1.0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
108441,ID_ZZYY7RTO,111,4,23.0,2,NaN,NaN,2,2.0,NaN,...,2.0,NaN,2,2,NaN,NaN,1.0,NaN,1,0
108442,ID_ZZYZTTC6,77,4,60.0,1,NaN,NaN,2,NaN,NaN,...,NaN,NaN,2,2,NaN,NaN,1.0,1.0,1,0
108443,ID_ZZZ3OW3S,42,2,59.0,1,NaN,1.0,1,NaN,1.0,...,NaN,NaN,2,2,2.0,2.0,1.0,2.0,1,1
108444,ID_ZZZLDXE8,57,7,79.0,1,NaN,NaN,2,1.0,NaN,...,NaN,NaN,2,2,2.0,NaN,1.0,1.0,1,0
108445,ID_ZZZMYW1F,110,2,74.0,2,1.0,2.0,2,1.0,1.0,...,2.0,NaN,2,2,1.0,NaN,1.0,NaN,1,1

You can also drop specific rows with a higher number of missing values. This may increase the accuracy of your model rather than filling these columns. This is beneficial only when you have a large amount of data.

>>> train.isnull().sum(axis=1).sort_values(ascending=False).head()

#Drop Rows of pandas DataFrame that Contain X or More Missing Values

This example demonstrates how to remove rows from a data set that contain a certain amount of missing values.
In the following example code, all rows with 2 or more NaN values are dropped:

In [16]:
train = train.dropna(thresh = 2)                # Apply dropna() function
train

,ID,country_code,region,age,FQ1,FQ2,FQ3,FQ4,FQ6,FQ7,...,FQ24,FQ35,FQ25,FQ26,FQ29,FQ32,FQ33,FQ34,FQ37,Target
0,ID_000J8GTZ,1,6,35.0,2,NaN,NaN,2,NaN,1.0,...,NaN,1.0,2,2,1.0,NaN,1.0,1.0,0,0
1,ID_000QLXZM,32,7,70.0,2,NaN,NaN,2,NaN,1.0,...,NaN,NaN,1,1,2.0,NaN,1.0,2.0,0,0
2,ID_001728I2,71,7,22.0,2,1.0,NaN,2,NaN,1.0,...,NaN,NaN,2,1,2.0,NaN,2.0,1.0,1,0
3,ID_001R7IDN,48,3,27.0,1,NaN,NaN,2,2.0,NaN,...,NaN,NaN,2,2,NaN,2.0,1.0,1.0,1,0
4,ID_0029QKF8,25,0,79.0,2,NaN,NaN,2,NaN,NaN,...,2.0,NaN,2,2,2.0,2.0,1.0,1.0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
108441,ID_ZZYY7RTO,111,4,23.0,2,NaN,NaN,2,2.0,NaN,...,2.0,NaN,2,2,NaN,NaN,1.0,NaN,1,0
108442,ID_ZZYZTTC6,77,4,60.0,1,NaN,NaN,2,NaN,NaN,...,NaN,NaN,2,2,NaN,NaN,1.0,1.0,1,0
108443,ID_ZZZ3OW3S,42,2,59.0,1,NaN,1.0,1,NaN,1.0,...,NaN,NaN,2,2,2.0,2.0,1.0,2.0,1,1
108444,ID_ZZZLDXE8,57,7,79.0,1,NaN,NaN,2,1.0,NaN,...,NaN,NaN,2,2,2.0,NaN,1.0,1.0,1,0
108445,ID_ZZZMYW1F,110,2,74.0,2,1.0,2.0,2,1.0,1.0,...,2.0,NaN,2,2,1.0,NaN,1.0,NaN,1,1

import missingno as msno
msno.matrix(train, inline=True, sparkline=True, figsize=(20,10), sort='ascending', fontsize=12, labels=True, color=(0.30, 0.15, 0.43))

In [17]:
train.isnull().sum()

ID                  0
country_code        0
region              0
age               322
FQ1                 0
FQ2             59322
FQ3             62228
FQ4                 0
FQ6             47787
FQ7             47826
FQ8                 0
FQ9                 0
FQ10                0
FQ11            24570
FQ12                0
FQ13                0
FQ14                0
FQ15                0
FQ16                0
FQ18                0
FQ19            47407
FQ20            24679
FQ21            24635
FQ22                0
FQ23                0
FQ24            70014
FQ35            82557
FQ25                0
FQ26                0
FQ29            24534
FQ32            47650
FQ33                2
FQ34            31794
FQ37                0
Target              0
dtype: int64

In [18]:
train.dropna(subset = ['FQ33'], axis = 0, how = 'any', inplace = True)
train.isnull().sum()

ID                  0
country_code        0
region              0
age               322
FQ1                 0
FQ2             59321
FQ3             62228
FQ4                 0
FQ6             47786
FQ7             47825
FQ8                 0
FQ9                 0
FQ10                0
FQ11            24569
FQ12                0
FQ13                0
FQ14                0
FQ15                0
FQ16                0
FQ18                0
FQ19            47406
FQ20            24679
FQ21            24635
FQ22                0
FQ23                0
FQ24            70013
FQ35            82556
FQ25                0
FQ26                0
FQ29            24533
FQ32            47649
FQ33                0
FQ34            31794
FQ37                0
Target              0
dtype: int64

In [19]:
X = train.drop(['ID','Target'], axis = 1)
y = train['Target']

X

,country_code,region,age,FQ1,FQ2,FQ3,FQ4,FQ6,FQ7,FQ8,...,FQ23,FQ24,FQ35,FQ25,FQ26,FQ29,FQ32,FQ33,FQ34,FQ37
0,1,6,35.0,2,NaN,NaN,2,NaN,1.0,2,...,2,NaN,1.0,2,2,1.0,NaN,1.0,1.0,0
1,32,7,70.0,2,NaN,NaN,2,NaN,1.0,2,...,2,NaN,NaN,1,1,2.0,NaN,1.0,2.0,0
2,71,7,22.0,2,1.0,NaN,2,NaN,1.0,2,...,2,NaN,NaN,2,1,2.0,NaN,2.0,1.0,1
3,48,3,27.0,1,NaN,NaN,2,2.0,NaN,2,...,2,NaN,NaN,2,2,NaN,2.0,1.0,1.0,1
4,25,0,79.0,2,NaN,NaN,2,NaN,NaN,2,...,1,2.0,NaN,2,2,2.0,2.0,1.0,1.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
108441,111,4,23.0,2,NaN,NaN,2,2.0,NaN,1,...,2,2.0,NaN,2,2,NaN,NaN,1.0,NaN,1
108442,77,4,60.0,1,NaN,NaN,2,NaN,NaN,2,...,2,NaN,NaN,2,2,NaN,NaN,1.0,1.0,1
108443,42,2,59.0,1,NaN,1.0,1,NaN,1.0,2,...,2,NaN,NaN,2,2,2.0,2.0,1.0,2.0,1
108444,57,7,79.0,1,NaN,NaN,2,1.0,NaN,2,...,2,NaN,NaN,2,2,2.0,NaN,1.0,1.0,1
108445,110,2,74.0,2,1.0,2.0,2,1.0,1.0,2,...,2,2.0,NaN,2,2,1.0,NaN,1.0,NaN,1

test = test.drop(['ID', 'FQ5', 'FQ17', 'FQ36', 'FQ27', 'FQ28', 'FQ30', 'FQ31'], axis= 1)

In [20]:
X_test = test.drop(['ID', 'FQ5', 'FQ17', 'FQ36', 'FQ27', 'FQ28', 'FQ30', 'FQ31'], axis= 1)

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=999)

In [ ]:
from sklearn.impute import KNNImputer

#Initialize KNNImputer
imputer = KNNImputer (n_neighbors = 2)

#Impute/Fill Missing values of each feature
X_imputed = pd.DataFrame(imputer.fit_transform (X_train, y_train),  columns= X.columns)

results = imputer.transform (X_test)

results.shape

In [ ]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df = pd.DataFrame(scaler.fit_transform(df), columns = df.columns)
df.head()

In [ ]:
from sklearn.tree import DecisionTreeClassifier

clf = DecisionTreeClassifier()
clf = clf.fit (X_train, y_train)
results = clf.predict (X_test)

In [ ]:
from sklearn.impute import KNNImputer

#Initialize KNNImputer
imputer = KNNImputer (n_neighbors = 2)

#Impute/Fill Missing values of each feature
X_imputed = imputer.fit_transform (X)

In [ ]:
X_test = test.drop(['ID', 'FQ5', 'FQ17', 'FQ36', 'FQ27', 'FQ28', 'FQ30', 'FQ31'], axis= 1)

In [ ]:
from sklearn.ensemble import RandomForestClassifier
rf_model = RandomForestClassifier(n_estimators=100, max_depth=3, random_state=2)
rf_model.fit(X_imputed, y)
y_pred = model.predict(X_test)

In [ ]:
output = pd.DataFrame({'ID': test.ID, 'Target': y_pred})
output.to_csv('submission_RF2.csv', index=False)

from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
train = pd.DataFrame(scaler.fit_transform(train), columns = train.columns)
train.head()

## Imputing Missing Data Using Sklearn SimpleImputer
SimpleImputer is a class found in package sklearn.impute. It is used to impute / replace the numerical or categorical missing data related to one or more features with appropriate values. 
https://dzone.com/articles/imputing-missing-data-using-sklearn-simpleimputer

There are two columns / features (one numerical - marks, and another categorical - gender) which are having missing values and need to be imputed. In the code below, an instance of SimpleImputer is created with strategy as "mean". The missing value is represented using NaN. Note some of the following:

sklearn.impute package is used for importing SimpleImputer class.
SimpleImputer takes two argument such as missing_values and strategy.
fit_transform method is invoked on the instance of SimpleImputer to impute the missing values.

### Imputation Approach with KNNImputer
We will use the KNNImputer function from the impute module of the sklearn. KNNImputer helps to impute missing values present in the observations by finding the nearest neighbors with the Euclidean distance matrix.

In [ ]:
from sklearn.impute import KNNImputer

#KNN based imputation for categorical variables
imputer = KNNImputer (n_neighbors = 2)


imputed_train = imputer.fit_transform(train[['country_code', 'region', 'age', 'FQ1', 'FQ2', 'FQ3', 'FQ4','FQ5', 'FQ6', 'FQ7', 'FQ8', 'FQ9', 'FQ10', 'FQ11', 'FQ12', 'FQ13','FQ14', 'FQ15', 'FQ16', 'FQ17', 'FQ18', 'FQ19', 'FQ20', 'FQ21', 'FQ22','FQ23', 'FQ24', 'FQ35', 'FQ36', 'FQ25', 'FQ26', 'FQ27', 'FQ28', 'FQ29','FQ30', 'FQ31', 'FQ32', 'FQ33', 'FQ34', 'FQ37']])

#print the completed dataframe
imputed_train

In [ ]:
# Importing the SimpleImputer class
from sklearn.impute import SimpleImputer
  
# Imputer object using the mean strategy and 
# missing_values type for imputation
imputer = SimpleImputer(missing_values = np.nan, 
                        strategy ='mean')
  
# Fitting the data to the imputer object
imputer = imputer.fit(train)
  
# Imputing the data     
imputed_train = imputer.transform(train)
  
print("Imputed Data : \n", imputed_train)

In [ ]:
from sklearn.impute import SimpleImputer

# Missing values is represented using NaN and hence specified. If it is empty field, missing values will be specified as:

imputer = SimpleImputer(missing_values=np.NaN, strategy='mean')

dfstd.marks = imputer.fit_transform(dfstd['marks'].values.reshape(-1,1))[:,0]

dfstd

To drop all rows with 'any' NAs in a particular column, I used .dropna() and specified the subset = column.

In [ ]:
train.isnull().sum()

In [ ]:
train.dropna(subset = ['FQ33'], axis = 0, how = 'any', inplace = True)
train.isnull().sum()

In [ ]:
train.drop(columns="cabin")

In [ ]:
#Class Distribution
target_counts = train.groupby('Target').size()
print(target_counts)

You can see that there are nearly triple the number of observations with target 0 than there are with target 1.

## Examine Target Column

In [ ]:
train['Target'].value_counts()

In [ ]:
s = sns.countplot(x = 'Target',data = train)
sizes=[]
for p in s.patches:
    height = p.get_height()
    sizes.append(height)
    s.text(p.get_x()+p.get_width()/2.,
            height + 3,
            '{:1.2f}%'.format(height/len(train)*100),
            ha="center", fontsize=14)

## Create Features

sns.pairplot(train, hue='Target', size=1.5);

In [ ]:
# Select first three rows
train.iloc[1:4]

## Replace Multiple Values in Multiple Columns

Target Category:
- 1: Yes
- 2: No
- 3: Donâ€™t know 
- 4: Refused to answer

train.count()

train.replace({'FQ1': {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ2' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ3' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ4' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ5' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ6'{1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ7' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ8' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ9' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ10' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ11'{1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ12' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ13'{1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ14' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ15' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ16' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ17' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ18' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ19' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ20' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ21' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ22' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ23' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ24' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ35' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ36'{1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ25'{1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ26' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ27' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ28' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ29' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'},
'FQ30'{1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ31' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ32' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ33' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ34' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}, 
'FQ37' {1: 'Yes', 2: 'No', 3: 'Donâ€™t know', 4: 'Refused to answer'}})

In [ ]:
train.columns

In [ ]:
# Select unique values
train['country_code'].unique()

In [ ]:
# Alternatively, value_counts will display all unique values with the number of times each value appears:
# Show counts
train['country_code'].value_counts()

In [ ]:
# Select unique values
train['region'].value_counts()

Both unique and value_counts are useful for manipulating and exploring categorical
columns.

In [ ]:
train['FQ1'].value_counts()

In [ ]:
train['FQ4'].value_counts()

In [ ]:
train.dtypes

In [ ]:
#Change multiple columns with float to int
train[['FQ1', 'FQ2', 'FQ3', 'FQ4',
       'FQ5', 'FQ6', 'FQ7', 'FQ8', 'FQ9', 'FQ10', 'FQ11', 'FQ12', 'FQ13',
       'FQ14', 'FQ15', 'FQ16', 'FQ17', 'FQ18', 'FQ19', 'FQ20', 'FQ21', 'FQ22',
       'FQ23', 'FQ24', 'FQ35', 'FQ36', 'FQ25', 'FQ26', 'FQ27', 'FQ28', 'FQ29',
       'FQ30', 'FQ31', 'FQ32', 'FQ33', 'FQ34', 'FQ37']].astype(int)

In [ ]:
train.dtypes